{
  "users": [
    {
      "id": "1",
      "username": "grantc802",
      "firstName": "Grant",
      "lastName": "Cummings",
      "favoriteFilmQuote": "Life is like a box of choclates, you never know what you're gonna get.",
      "quoteAuthor": "Forrest Gump",
      "profilePhoto": "https://i.guim.co.uk/img/media/78eb1f6bd0f92d4d3cf19f5bddda1a902e2a6fcd/0_95_2371_1422/master/2371.jpg?width=1200&quality=85&auto=format&fit=max&s=e38a50cd354d94cc959a8a34f6536a7c",
      "birthday": "06/08/1997",
      "email": "grantcummings47@gmail.com",
      "favorites": [
        {
          "id": 823464,
          "poster_path": "/1DTP1Ph4uzNO6ofRUm7eAimWoKD.jpg",
          "backdrop_path": "/qrGtVFxaD8c7et0jUtaYhyTzzPg.jpg",
          "title": "Godzilla x Kong: The New Empire",
          "vote_average": 6.488,
          "overview": "Following their explosive showdown, Godzilla and Kong must reunite against a colossal undiscovered threat hidden within our world, challenging their very existence – and our own."
        },
        {
          "id": 63639,
          "poster_path": "/8djpxDeWpINnGhjpFXQjnBe6zbx.jpg",
          "backdrop_path": "/7yKtaRij2giAj0s09F6gmB8XIje.jpg",
          "name": "The Expanse",
          "vote_average": 8.049,
          "overview": "A thriller set two hundred years in the future following the case of a missing young woman who brings a hardened detective and a rogue ship's captain together in a race across the solar system to expose the greatest conspiracy in human history."
        },
        {
          "id": 13,
          "poster_path": "/arw2vcBveWOVZr6pxd9XTd1TdQa.jpg",
          "backdrop_path": "/qdIMHd4sEfJSckfVJfKQvisL02a.jpg",
          "title": "Forrest Gump",
          "vote_average": 8.475,
          "overview": "A man with a low IQ has accomplished great things in his life and been present during significant historic events—in each case, far exceeding what anyone imagined he could do. But despite all he has achieved, his one true love eludes him."
        },
        {
          "id": 13475,
          "poster_path": "/lV5OpzAss1z06YNagOVap1I35mH.jpg",
          "backdrop_path": "/q7M0JpPixbEYT8EhnI7wTEMONxz.jpg",
          "title": "Star Trek",
          "vote_average": 7.433,
          "overview": "The fate of the galaxy rests in the hands of bitter rivals. One, James Kirk, is a delinquent, thrill-seeking Iowa farm boy. The other, Spock, a Vulcan, was raised in a logic-based society that rejects all emotion. As fiery instinct clashes with calm reason, their unlikely but powerful partnership is the only thing capable of leading their crew through unimaginable danger, boldly going where no one has gone before. The human adventure has begun again."
        },
        {
          "id": 122,
          "poster_path": "/rCzpDGLbOoPwLjy3OAm5NUPOTrC.jpg",
          "backdrop_path": "/2u7zbn8EudG6kLlBzUYqP8RyFU4.jpg",
          "title": "The Lord of the Rings: The Return of the King",
          "vote_average": 8.48,
          "overview": "Aragorn is revealed as the heir to the ancient kings as he, Gandalf and the other members of the broken fellowship struggle to save Gondor from Sauron's forces. Meanwhile, Frodo and Sam take the ring closer to the heart of Mordor, the dark lord's realm."
        },
        {
          "id": 361743,
          "poster_path": "/62HCnUTziyWcpDaBO2i1DX17ljH.jpg",
          "backdrop_path": "/AaV1YIdWKnjAIAOe8UUKBFm327v.jpg",
          "title": "Top Gun: Maverick",
          "vote_average": 8.221,
          "overview": "After more than thirty years of service as one of the Navy’s top aviators, and dodging the advancement in rank that would ground him, Pete “Maverick” Mitchell finds himself training a detachment of TOP GUN graduates for a specialized mission the likes of which no living pilot has ever seen."
        },
        {
          "id": 299536,
          "poster_path": "/7WsyChQLEftFiDOVTGkv3hFpyyt.jpg",
          "backdrop_path": "/mDfJG3LC3Dqb67AZ52x3Z0jU0uB.jpg",
          "title": "Avengers: Infinity War",
          "vote_average": 8.246,
          "overview": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain."
        }
      ],
      "likes": [
        {
          "id": 307081,
          "poster_path": "/kSQ49Fi3NVTqGGXILmxV2T2pdkG.jpg",
          "backdrop_path": "/1tXlUvfhLVjM5rZcN2783IhCkbu.jpg",
          "title": "Southpaw",
          "vote_average": 7.4,
          "overview": "Billy \"The Great\" Hope, the reigning junior middleweight boxing champion, has an impressive career, a loving wife and daughter, and a lavish lifestyle. However, when tragedy strikes, Billy hits rock bottom, losing his family, his house and his manager. He soon finds an unlikely savior in Tick Willis, a former fighter who trains the city's toughest amateur boxers. With his future on the line, Hope fights to reclaim the trust of those he loves the most."
        },
        {
          "id": 120,
          "poster_path": "/6oom5QYQ2yQTMJIbnvbkBL9cHo6.jpg",
          "backdrop_path": "/x2RS3uTcsJJ9IfjNPcgDmukoEcQ.jpg",
          "title": "The Lord of the Rings: The Fellowship of the Ring",
          "vote_average": 8.412,
          "overview": "Young hobbit Frodo Baggins, after inheriting a mysterious ring from his uncle Bilbo, must leave his home in order to keep it from falling into the hands of its evil creator. Along the way, a fellowship is formed to protect the ringbearer and make sure that the ring arrives at its final destination: Mt. Doom, the only place where it can be destroyed."
        },
        {
          "id": 508442,
          "poster_path": "/hm58Jw4Lw8OIeECIq5qyPYhAeRJ.jpg",
          "backdrop_path": "/rQaHA74pevnGsxcKGaoZVGWe9TC.jpg",
          "title": "Soul",
          "vote_average": 8.133,
          "overview": "Joe Gardner is a middle school teacher with a love for jazz music. After a successful audition at the Half Note Club, he suddenly gets into an accident that separates his soul from his body and is transported to the You Seminar, a center in which souls develop and gain passions before being transported to a newborn child. Joe must enlist help from the other souls-in-training, like 22, a soul who has spent eons in the You Seminar, in order to get back to Earth."
        },
        {
          "id": 10528,
          "poster_path": "/momkKuWburNTqKBF6ez7rvhYVhE.jpg",
          "backdrop_path": "/veXdzn7LL0bFIDGmE7tTkvRg0qV.jpg",
          "title": "Sherlock Holmes",
          "vote_average": 7.21,
          "overview": "Eccentric consulting detective Sherlock Holmes and Doctor John Watson battle to bring down a new nemesis and unravel a deadly plot that could destroy England."
        },
        {
          "id": 785663,
          "poster_path": "/eE1SL0QoDsvAMqQly56IkRtlN1W.jpg",
          "backdrop_path": "/o7qbLdslYik6b8TDpepzTAo2RBx.jpg",
          "title": "Old Henry",
          "vote_average": 7.242,
          "overview": "A widowed farmer and his son warily take in a mysterious, injured man with a satchel of cash. When a posse of men claiming to be the law come for the money, the farmer must decide who to trust. Defending a siege of his homestead, the farmer reveals a talent for gun-slinging that surprises everyone calling his true identity into question."
        },
        {
          "id": 299534,
          "poster_path": "/or06FN3Dka5tukK1e9sl16pB3iy.jpg",
          "backdrop_path": "/7RyHsO4yDXtBv1zUU3mTpHeQ0d5.jpg",
          "title": "Avengers: Endgame",
          "vote_average": 8.3,
          "overview": "After the devastating events of Avengers: Infinity War, the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos' actions and restore order to the universe once and for all, no matter what consequences may be in store."
        }
      ]
    },
    {
      "id": "31ec",
      "firstName": "Todd",
      "lastName": "Peterson",
      "username": "tpBoy44",
      "profilePhoto": "https://lumiere-a.akamaihd.net/v1/images/I-Am-Your-Father_cfc92651.jpeg?region=416%2C0%2C1444%2C812",
      "favoriteFilmQuote": "Luke I am your father",
      "quoteAuthor": "Darth Vader",
      "email": "todP@gmail.com",
      "birthday": "1998-06-07",
      "likes": [],
      "favorites": []
    }
  ]
}